app/views/console/regions/index.html.erb

SELECT COUNT(*) FROM `regions`
SELECT `regions`.* FROM `regions`
---
    <div class="panel-body">
      目前AWS已全球覆盖<%= link_to  Region.all.count,list_console_regions_path %>个地区,您个可以根据您的需求选择不同地区的服务.
      <p>