app/views/console/categories/destroy.js.erb

DELETE FROM `categories` WHERE `categories`.`id` = 7
---
<% if @category.destroyed? %>