app/views/console/players/destroy.js.erb

<% if @player.destroyed? %>
---
DELETE FROM `players` WHERE `players`.`id` = 2