app/views/console/players/index.html.erb

SELECT COUNT(*) FROM `players`
---
  <div class="panel-body">
    当前系统共有个<%= Player.all.count %>玩家