app/controllers/console/categories_controller.rb

SELECT `categories`.* FROM `categories`
---
	def list
		@categories = Category.all

INSERT INTO `categories` (`code`, `created_at`, `en_name`, `name`, `updated_at`) VALUES ('23423', '2013-08-28 08:50:13', '234234', '4234', '2013-08-28 08:50:13')
---
	def create
		@category = Category.new(params.require(:category).permit(:code,:name,:en_name))
		if @category.save

UPDATE `categories` SET `name` = '42343333dfsdf', `updated_at` = '2013-08-28 08:50:40' WHERE `categories`.`id` = 6
---
	def update
		if @category.update_attributes(params.require(:category).permit(:name,:en_name))

DELETE FROM `categories` WHERE `categories`.`id` = 7
---
	def destroy
		@category.destroy if @category