app/controllers/console/players_controller.rb

	def list
		@players = Player.all.paginate(:page => params[:page], :per_page => 10)
---
SELECT `players`.* FROM `players` LIMIT 10 OFFSET 0

	def create
		@player = Player.new(params.require(:player).permit(:name,:email,:phone,:password,:password_confirmation))
		if @player.save
---
INSERT INTO `players` (`created_at`, `email`, `encrypted_password`, `name`, `phone`, `updated_at`) VALUES ('2013-08-28 07:21:42', 'it@aw7s.co', '$2a$10$YbwP33NYOf/x3gAP3/EHceTWZLegQAovd32KTSMjkHb3xsJWz2ZBK', '33432', '', '2013-08-28 07:21:42')

	def edit
		@player = Player.find_by_id(params[:id])
---
SELECT `players`.* FROM `players` WHERE `players`.`id` = 1 ORDER BY `players`.`id` ASC LIMIT 1

	def destroy
		@player = Player.find_by_id(params[:id])
		return render :js =>'alert("没有这个玩家!");' unless @player
		return render :js =>'alert("不能删除当前玩家!");' if @player == current_player
		return render :js =>'alert("不能删除Master玩家!");' if @player.is_master
		@player.destroy
---
SELECT `players`.* FROM `players` WHERE `players`.`id` = 1 ORDER BY `players`.`id` ASC LIMIT 1
DELETE FROM `players` WHERE `players`.`id` = 2