app/controllers/console/regions_controller.rb

SELECT `regions`.* FROM `regions`
---
	def index
		@regions = Region.all

SELECT `regions`.* FROM `regions` WHERE `regions`.`id` = 1 LIMIT 1
---
	def show
		@region = Region.find_by_id(params[:id])

SELECT `regions`.* FROM `regions`
---
	def list
		@regions = Region.all