app/controllers/console/registrations_controller.rb

	def create
		@player = Player.new(params.require(:player).permit(:name,:email,:password,:password_confirmation))
		@player.phone = ""
		if @player.save
---
INSERT INTO `players` (`created_at`, `email`, `encrypted_password`, `name`, `phone`, `updated_at`) VALUES ('2013-08-28 09:45:10', 'it@aw7s.coh', '$2a$10$2n9pwAu.Badan7kAcHxCtOVg/qPfybBGsPce6yczSavlrh7kh3G72', '546456', '', '2013-08-28 09:45:10')