app/controllers/console/services_controller.rb

SELECT `services`.* FROM `services` WHERE `services`.`id` = 1 LIMIT 1
---
	def show
		@service = Service.find_by_id(params[:id])

SELECT COUNT(*) FROM `services`
SELECT `services`.* FROM `services` LIMIT 10 OFFSET 0
---
	def list
		@services = Service.all.paginate(:page => params[:page], :per_page => 10)

SELECT `services`.* FROM `services` WHERE `services`.`id` = 11 LIMIT 1
---
	def edit
		@service = Service.find_by_id(params[:id])

SELECT `services`.* FROM `services` WHERE `services`.`id` = 11 LIMIT 1
UPDATE `services` SET `normal` = 0, `updated_at` = '2013-08-28 03:45:23' WHERE `services`.`id` = 11
---
	def update
		@service = Service.find_by_id(params[:id])

		if @service.update_attributes(params.require(:service).permit(:category_code,:name,:full_name,:caption,:normal))

SELECT `services`.* FROM `services` WHERE `services`.`id` = 11 LIMIT 1
---
	def coverings
		@service = Service.find_by_id(params[:id])

SELECT `services`.* FROM `services` WHERE `services`.`id` = 1 LIMIT 1
---
	def destroy
		@service = Service.find_by_id(params[:id])