app/controllers/console/zones_controller.rb

INSERT INTO `zones` (`code`, `created_at`, `region_code`, `remark`, `updated_at`) VALUES ('', '2013-08-28 08:19:36', 'us-east-1', '', '2013-08-28 08:19:36')
---
	def create
		@region.zones.build(params.require(:zone).permit(:code,:remark,:normal))
		if @region.save

SELECT `zones`.* FROM `zones` WHERE `zones`.`id` = 1 LIMIT 1
---
	def edit
		@zone = @region.zones.find_by_id(params[:id])

UPDATE `zones` SET `remark` = '323333', `updated_at` = '2013-08-29 01:57:44' WHERE `zones`.`id` = 22
---
	def update
		@zone = @region.zones.find_by_id(params[:id])
		if @zone.update_attributes(params.require(:zone).permit(:code,:remark,:normal))

SELECT `zones`.* FROM `zones` WHERE `zones`.`id` = 22 LIMIT 1
DELETE FROM `zones` WHERE `zones`.`id` = 22
---
	def destroy
		@zone = @region.zones.find_by_id(params[:id])
		@zone.destroy if @zone