app/views/console/zones/destroy.js.erb

<% if @zone.destroyed? %>
---
DELETE FROM `zones` WHERE `zones`.`id` = 22