app/views/console/services/_form.html.erb

  <div class="col-lg-3">
     <%= collection_select(:service, :category_code, Category.all, :code, :full_name,{},{:class=>"form-control"}) %>
---
SELECT `categories`.* FROM `categories`